---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteAssemblyView
source: html/b6de058e-ab5a-afa8-f907-477159c4be4a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotPasteAssemblyView Property

Can't paste assembly view because its associated assembly instance is not available.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteAssemblyView { get; }
```